[
  "Retinoid Nipples@desibrownie·2mReplying to @Bauuaji_97Don’t come for my insulinThe following media includes potentially sensitive content. Change settingsView",
  "Sonia@Sonia67682293·5mA friend listened to the negative comments, stopped taking the meds. It was a bad time for them and everyone around them but luckily they are still here and back on their the meds. As a wonderful doctor said if you were diabetic would you stop taking insulin. Ignore the ignoranceQuote TweetCharlie Smith@charliersmith1 · 13hI’ve seen a lot of anti-depressant shaming recently.\n\nSo just a reminder that, there’s nothing wrong with taking meds for your mental health. I take several tablets daily - and there’s no way I’d still be here without them. \n\nStigma around them really needs to stop",
  "Si Anak Tengah@takutdiabetes·6m\"Saya sih alhamdulillah ya msh ketolong cepet pasang ring dibantu prosesnya sm temen ga pk bpjs, recovery cepet, diabetes jg masih aman lah ga kaya mamanya Sarah sampe injeksi insulin\"\n\nEH GIMANE KOK NYOKAP GUE LU BAWA-BAWA ANJEEENGShow this thread",
  "Ambitech Healthcare@AmbiTech4Health·6m#diabetes #type #t #diabetic #diabetestype #health #stroke #diabetesawareness #d #cancer #diabetestipo #healthylifestyle #insulin #kanker #diet #asamurat #sop #weightloss #covid #jantung #kolesterol #fitness #darahtinggi #herbal #salud #obatdiabetes #hipertensi #healthyThe media could not be played.Reload",
  "Insulin@privateglukosa·6mReplying to @bayu_joosometimes we can change our mood in different conditions and in different people",
  "Dr.T, PhD I Longevity Sci I ChronicIllRecovery@chydorina·8mReplying to @sashachapin#Peptides. While some peptides i.e. insulin are widely used in the West - #peptide research and treatment is standard in Eastern Europe and as a whole, this class of 'medicine' is mechanistically and philosophically different from the Western drug model.link.springer.comPreparations Based on Regulatory Peptides—a New...Neurochemical Journal - Abstract—Regulatory peptides have modulatory and integrative functions defining communication between different systems of the body. This review summarizes and...",
  "Insulin@privateglukosa·9mReplying to @haindraaarasa coklat enakk",
  "Insulin@privateglukosa·10mReplying to @naqsabannngurten hutte pasti , lek kesana mending pagi sama sore apik view ne",
  "Esther Bojanac@EBojanac·12mReplying to @KommtDraufAn2Oder Penicillin, Insulin, Schmerzmittel, Narkose,....1",
  "Insulin or Death  2@jpnairn·13mReplying to @Alexand51596762 and @brutal_regimeIf we all vote Green, it might be different.1",
  "JohnLittle@JohnLit83206830·13mResults The time in the in-deprtment ws shorter distinctively thn tht of without using insulin-pump.",
  "Insulin or Death  2@jpnairn·14mReplying to @brutal_regime and @goodgawdallmyte\"It's the most important election of our lives.\"12",
  "BethDamis@BethDamis·21mReplying to @Kidfears99JEALOUS!! Emergency backlogs of Insulin are magic!",
  "PaulaJaramilloStewar@pstewart55·21mReplying to @TrashBoat1969You can’t just give up insulin!!1",
  "dr ghost w/o contrast@InsulinCracker·24mReplying to @robintran04Twitter you good?",
  "Insulin or Death  2@jpnairn·27mReplying to @joeywreckInstead? No.\nAlso? Yes.1",
  "Ashley Carmona @ashleychagoya·29mI’m not sure how to explain this but I’m gonna try to: there was this feeling that I can only seem to describe as relief, but I think that’s the wrong word, when I went over to my friends house today, and I wasn’t sure if it was her insulin pen or mine on the table, lol. It was1Show this thread",
  "PLK Lancet Kenya@LancetKenya_PLK·30mThe hormone also boosts insulin sensitivity and increases the breakdown of fatty acid in the liver. This process, in turn, decreases the manufacturing of glucose by the liver. A low result might suggest Type 2 diabetes mellitus or metabolic syndrome. \n\n#bloodtests \n#LancetCares1Show this thread",
  "dr ghost w/o contrast@InsulinCracker·25mReplying to @robintran04Twitter you good?",
  "sorcova de corb@autonomy_eth·31mReplying to @autonomy_eth and @TruthIsADarewhat has taken place with food & drink has long careened from commerce into lies & treachery\n\ncorn syrup, seed oils, cancerous additives, preservatives \n\nthe gaming of dopaminergic pathways, mass rewiring of insulin response\n\nbetrayal",
  "Dha_Insulin@Umoru_insulin·37mReplying to @NewggGiveaways and @MetaMarauders@PasOnotse @FridayOtaigbe \nLezzgo",
  "Dha_Insulin@Umoru_insulin·37mReplying to @viralnft0x938A02b4b3677E88eb6BADE43ba0D3b37B88364f",
  "Smiffy he/him/they/them@WeRWorld·38mReplying to @ataafeThe blood sugar I'd happily ignore until I see my main GP end of next week. The ketones are of concern. I may need insulin.1",
  "Dha_Insulin@Umoru_insulin·38mReplying to @nftchocapic0x938A02b4b3677E88eb6BADE43ba0D3b37B88364f",
  "Lil Insulin@LilRussell00·38mGotta see it throughQuote TweetRico@RicoBanned · 3hImagine you in a zombie apocalypse and you tryna escape but you run into AriTheDon as a zombie",
  "Dha_Insulin@Umoru_insulin·39mReplying to @WoofSolana@Aldolase16"
]
